chaitanyashahare.lazygit
charliermarsh.ruff
cheshirekow.cmake-format
eeyore.yapf
esbenp.prettier-vscode
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
llvm-vs-code-extensions.vscode-clangd
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
rangav.vscode-thunder-client
redhat.ansible
redhat.vscode-yaml
twxs.cmake
vadimcn.vscode-lldb
